espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_prs_signals.h
/**
 * Asynchronous signals and sources combined and aligned with register bit fields
 * without the '_ASYNCH_' infix in order for backward compatibility:
 */
#define PRS_USART0_CS                                        (PRS_ASYNC_USART0_CS)
#define PRS_USART0_IRTX                                      (PRS_ASYNC_USART0_IRTX)
#define PRS_USART0_RTS                                       (PRS_ASYNC_USART0_RTS)
#define PRS_USART0_RXDATA                                    (PRS_ASYNC_USART0_RXDATA)
#define PRS_USART0_TX                                        (PRS_ASYNC_USART0_TX)
#define PRS_USART0_TXC                                       (PRS_ASYNC_USART0_TXC)
#define PRS_USART1_CS                                        (PRS_ASYNC_USART1_CS)
#define PRS_USART1_IRTX                                      (PRS_ASYNC_USART1_IRTX)
#define PRS_USART1_RTS                                       (PRS_ASYNC_USART1_RTS)
#define PRS_USART1_RXDATA                                    (PRS_ASYNC_USART1_RXDATA)
#define PRS_USART1_TX                                        (PRS_ASYNC_USART1_TX)
#define PRS_USART1_TXC                                       (PRS_ASYNC_USART1_TXC)
#define PRS_USART2_CS                                        (PRS_ASYNC_USART2_CS)
#define PRS_USART2_IRTX                                      (PRS_ASYNC_USART2_IRTX)
#define PRS_USART2_RTS                                       (PRS_ASYNC_USART2_RTS)
#define PRS_USART2_RXDATA                                    (PRS_ASYNC_USART2_RXDATA)
#define PRS_USART2_TX                                        (PRS_ASYNC_USART2_TX)
#define PRS_USART2_TXC                                       (PRS_ASYNC_USART2_TXC)
#define PRS_TIMER0_UF                                        (PRS_ASYNC_TIMER0_UF)
#define PRS_TIMER0_OF                                        (PRS_ASYNC_TIMER0_OF)
#define PRS_TIMER0_CC0                                       (PRS_ASYNC_TIMER0_CC0)
#define PRS_TIMER0_CC1                                       (PRS_ASYNC_TIMER0_CC1)
#define PRS_TIMER0_CC2                                       (PRS_ASYNC_TIMER0_CC2)
#define PRS_TIMER1_UF                                        (PRS_ASYNC_TIMER1_UF)
#define PRS_TIMER1_OF                                        (PRS_ASYNC_TIMER1_OF)
#define PRS_TIMER1_CC0                                       (PRS_ASYNC_TIMER1_CC0)
#define PRS_TIMER1_CC1                                       (PRS_ASYNC_TIMER1_CC1)
#define PRS_TIMER1_CC2                                       (PRS_ASYNC_TIMER1_CC2)
#define PRS_IADC0_SCANENTRYDONE                              (PRS_ASYNC_IADC0_SCANENTRYDONE)
#define PRS_IADC0_SCANTABLEDONE                              (PRS_ASYNC_IADC0_SCANTABLEDONE)
#define PRS_IADC0_SINGLEDONE                                 (PRS_ASYNC_IADC0_SINGLEDONE)
#define PRS_LETIMER0_CH0                                     (PRS_ASYNC_LETIMER0_CH0)
#define PRS_LETIMER0_CH1                                     (PRS_ASYNC_LETIMER0_CH1)
#define PRS_RTCC_CCV0                                        (PRS_ASYNC_RTCC_CCV0)
#define PRS_RTCC_CCV1                                        (PRS_ASYNC_RTCC_CCV1)
#define PRS_RTCC_CCV2                                        (PRS_ASYNC_RTCC_CCV2)
#define PRS_BURTC_COMP                                       (PRS_ASYNC_BURTC_COMP)
#define PRS_BURTC_OVERFLOW                                   (PRS_ASYNC_BURTC_OVERFLOW)
#define PRS_GPIO_PIN0                                        (PRS_ASYNC_GPIO_PIN0)
#define PRS_GPIO_PIN1                                        (PRS_ASYNC_GPIO_PIN1)
#define PRS_GPIO_PIN2                                        (PRS_ASYNC_GPIO_PIN2)
#define PRS_GPIO_PIN3                                        (PRS_ASYNC_GPIO_PIN3)
#define PRS_GPIO_PIN4                                        (PRS_ASYNC_GPIO_PIN4)
#define PRS_GPIO_PIN5                                        (PRS_ASYNC_GPIO_PIN5)
#define PRS_GPIO_PIN6                                        (PRS_ASYNC_GPIO_PIN6)
#define PRS_GPIO_PIN7                                        (PRS_ASYNC_GPIO_PIN7)
#define PRS_ACMP0_OUT                                        (PRS_ASYNC_ACMP0_OUT)
#define PRS_ACMP1_OUT                                        (PRS_ASYNC_ACMP1_OUT)
#define PRS_TIMER2_UF                                        (PRS_ASYNC_TIMER2_UF)
#define PRS_TIMER2_OF                                        (PRS_ASYNC_TIMER2_OF)
#define PRS_TIMER2_CC0                                       (PRS_ASYNC_TIMER2_CC0)
#define PRS_TIMER2_CC1                                       (PRS_ASYNC_TIMER2_CC1)
#define PRS_TIMER2_CC2                                       (PRS_ASYNC_TIMER2_CC2)
#define PRS_TIMER3_UF                                        (PRS_ASYNC_TIMER3_UF)
#define PRS_TIMER3_OF                                        (PRS_ASYNC_TIMER3_OF)
#define PRS_TIMER3_CC0                                       (PRS_ASYNC_TIMER3_CC0)
#define PRS_TIMER3_CC1                                       (PRS_ASYNC_TIMER3_CC1)
#define PRS_TIMER3_CC2                                       (PRS_ASYNC_TIMER3_CC2)
#define PRS_CORE_CTIOUT0                                     (PRS_ASYNC_CORE_CTIOUT0)
#define PRS_CORE_CTIOUT1                                     (PRS_ASYNC_CORE_CTIOUT1)
#define PRS_CORE_CTIOUT2                                     (PRS_ASYNC_CORE_CTIOUT2)
#define PRS_CORE_CTIOUT3                                     (PRS_ASYNC_CORE_CTIOUT3)
#define PRS_CMUL_CLKOUT0                                     (PRS_ASYNC_CMUL_CLKOUT0)
#define PRS_CMUL_CLKOUT1                                     (PRS_ASYNC_CMUL_CLKOUT1)
#define PRS_CMUL_CLKOUT2                                     (PRS_ASYNC_CMUL_CLKOUT2)
#define PRS_AGCL_CCA                                         (PRS_ASYNC_AGCL_CCA)
#define PRS_AGCL_CCAREQ                                      (PRS_ASYNC_AGCL_CCAREQ)
#define PRS_AGCL_GAINADJUST                                  (PRS_ASYNC_AGCL_GAINADJUST)
#define PRS_AGCL_GAINOK                                      (PRS_ASYNC_AGCL_GAINOK)
#define PRS_AGCL_GAINREDUCED                                 (PRS_ASYNC_AGCL_GAINREDUCED)
#define PRS_AGCL_IFPKI1                                      (PRS_ASYNC_AGCL_IFPKI1)
#define PRS_AGCL_IFPKQ2                                      (PRS_ASYNC_AGCL_IFPKQ2)
#define PRS_AGCL_IFPKRST                                     (PRS_ASYNC_AGCL_IFPKRST)
#define PRS_AGC_PEAKDET                                      (PRS_ASYNC_AGC_PEAKDET)
#define PRS_AGC_PROPAGATED                                   (PRS_ASYNC_AGC_PROPAGATED)
#define PRS_AGC_RSSIDONE                                     (PRS_ASYNC_AGC_RSSIDONE)
#define PRS_BUFC_THR0                                        (PRS_ASYNC_BUFC_THR0)
#define PRS_BUFC_THR1                                        (PRS_ASYNC_BUFC_THR1)
#define PRS_BUFC_THR2                                        (PRS_ASYNC_BUFC_THR2)
#define PRS_BUFC_THR3                                        (PRS_ASYNC_BUFC_THR3)
#define PRS_BUFC_CNT0                                        (PRS_ASYNC_BUFC_CNT0)
#define PRS_BUFC_CNT1                                        (PRS_ASYNC_BUFC_CNT1)
#define PRS_BUFC_FULL                                        (PRS_ASYNC_BUFC_FULL)
#define PRS_MODEML_ADVANCE                                   (PRS_ASYNC_MODEML_ADVANCE)
#define PRS_MODEML_ANT0                                      (PRS_ASYNC_MODEML_ANT0)
#define PRS_MODEML_ANT1                                      (PRS_ASYNC_MODEML_ANT1)
#define PRS_MODEML_COHDSADET                                 (PRS_ASYNC_MODEML_COHDSADET)
#define PRS_MODEML_COHDSALIVE                                (PRS_ASYNC_MODEML_COHDSALIVE)
#define PRS_MODEML_DCLK                                      (PRS_ASYNC_MODEML_DCLK)
#define PRS_MODEML_DOUT                                      (PRS_ASYNC_MODEML_DOUT)
#define PRS_MODEML_FRAMEDET                                  (PRS_ASYNC_MODEML_FRAMEDET)
#define PRS_MODEM_FRAMESENT                                  (PRS_ASYNC_MODEM_FRAMESENT)
#define PRS_MODEM_LOWCORR                                    (PRS_ASYNC_MODEM_LOWCORR)
#define PRS_MODEM_LRDSADET                                   (PRS_ASYNC_MODEM_LRDSADET)
#define PRS_MODEM_LRDSALIVE                                  (PRS_ASYNC_MODEM_LRDSALIVE)
#define PRS_MODEM_NEWSYMBOL                                  (PRS_ASYNC_MODEM_NEWSYMBOL)
#define PRS_MODEM_NEWWND                                     (PRS_ASYNC_MODEM_NEWWND)
#define PRS_MODEM_POSTPONE                                   (PRS_ASYNC_MODEM_POSTPONE)
#define PRS_MODEM_PREDET                                     (PRS_ASYNC_MODEM_PREDET)
#define PRS_MODEMH_PRESENT                                   (PRS_ASYNC_MODEMH_PRESENT)
#define PRS_MODEMH_RSSIJUMP                                  (PRS_ASYNC_MODEMH_RSSIJUMP)
#define PRS_MODEMH_SYNCSENT                                  (PRS_ASYNC_MODEMH_SYNCSENT)
#define PRS_MODEMH_TIMDET                                    (PRS_ASYNC_MODEMH_TIMDET)
#define PRS_MODEMH_WEAK                                      (PRS_ASYNC_MODEMH_WEAK)
#define PRS_MODEMH_EOF                                       (PRS_ASYNC_MODEMH_EOF)
#define PRS_FRC_DCLK                                         (PRS_ASYNC_FRC_DCLK)
#define PRS_FRC_DOUT                                         (PRS_ASYNC_FRC_DOUT)
#define PRS_PROTIMERL_BOF                                    (PRS_ASYNC_PROTIMERL_BOF)
#define PRS_PROTIMERL_CC0                                    (PRS_ASYNC_PROTIMERL_CC0)
#define PRS_PROTIMERL_CC1                                    (PRS_ASYNC_PROTIMERL_CC1)
#define PRS_PROTIMERL_CC2                                    (PRS_ASYNC_PROTIMERL_CC2)
#define PRS_PROTIMERL_CC3                                    (PRS_ASYNC_PROTIMERL_CC3)
#define PRS_PROTIMERL_CC4                                    (PRS_ASYNC_PROTIMERL_CC4)
#define PRS_PROTIMERL_LBTF                                   (PRS_ASYNC_PROTIMERL_LBTF)
#define PRS_PROTIMERL_LBTR                                   (PRS_ASYNC_PROTIMERL_LBTR)
#define PRS_PROTIMER_LBTS                                    (PRS_ASYNC_PROTIMER_LBTS)
#define PRS_PROTIMER_POF                                     (PRS_ASYNC_PROTIMER_POF)
#define PRS_PROTIMER_T0MATCH                                 (PRS_ASYNC_PROTIMER_T0MATCH)
#define PRS_PROTIMER_T0UF                                    (PRS_ASYNC_PROTIMER_T0UF)
#define PRS_PROTIMER_T1MATCH                                 (PRS_ASYNC_PROTIMER_T1MATCH)
#define PRS_PROTIMER_T1UF                                    (PRS_ASYNC_PROTIMER_T1UF)
#define PRS_PROTIMER_WOF                                     (PRS_ASYNC_PROTIMER_WOF)
#define PRS_RAC_ACTIVE                                       (PRS_ASYNC_RAC_ACTIVE)
#define PRS_RAC_LNAEN                                        (PRS_ASYNC_RAC_LNAEN)
#define PRS_RAC_PAEN                                         (PRS_ASYNC_RAC_PAEN)
#define PRS_RAC_RX                                           (PRS_ASYNC_RAC_RX)
#define PRS_RAC_TX                                           (PRS_ASYNC_RAC_TX)
#define PRS_SYNTH_MUX0                                       (PRS_ASYNC_SYNTH_MUX0)
#define PRS_SYNTH_MUX1                                       (PRS_ASYNC_SYNTH_MUX1)
#define PRS_PRORTC_CCV0                                      (PRS_ASYNC_PRORTC_CCV0)
#define PRS_PRORTC_CCV1                                      (PRS_ASYNC_PRORTC_CCV1)
#define PRS_LVGD_LVGDFALLDETECTED                            (PRS_ASYNC_LVGD_LVGDFALLDETECTED)
#define PRS_LVGD_LVGDFALLDETECTEDRAW                         (PRS_ASYNC_LVGD_LVGDFALLDETECTEDRAW)
#define PRS_LVGD_LVGDRISEDETECTED                            (PRS_ASYNC_LVGD_LVGDRISEDETECTED)
#define PRS_LVGD_LVGDRISEDETECTEDRAW                         (PRS_ASYNC_LVGD_LVGDRISEDETECTEDRAW)
#define PRS_SE_COREENGATED                                   (PRS_ASYNC_SE_COREENGATED)
#define PRS_SE_STATE0GATED                                   (PRS_ASYNC_SE_STATE0GATED)
#define PRS_SE_STATE1GATED                                   (PRS_ASYNC_SE_STATE1GATED)
#define PRS_SE_STATE2GATED                                   (PRS_ASYNC_SE_STATE2GATED)

#endif /* BGM21_PRS_SIGNALS_H */
